In [2]:
!pip install pymysql

Requirement already satisfied: pymysql in /opt/anaconda3/lib/python3.12/site-packages (1.1.1)

In [8]:
import pymysql
import pandas as pd
#connect to MySQL database
connection= pymysql.connect(
    host="localhost", #replace with your host
    user="root", #replace with your username
    password="shivanid", #replace with your password
    database="SQL_EXERCISES" #replace with your database name
)
cursor= connection.cursor()

In [10]:
#pymysql.connect(): This method establishes a connection to the MySQL database using the provided details. 
#It takes the following parameters [host, user, password, database]
# connection.cursor(): This creates a cursor object, which is used to interact with the database. 
#A cursor allows you to execute SQL queries, fetch results, and manage database transactions. 
#It acts as a pointer that moves through the data returned by the queries.

In [12]:
select_query= """SELECT E_ID, E_NAME, E_ADDRESS, E_SALARY, H_YEAR
FROM EMPLOYEES"""
cursor.execute(select_query)
rows = cursor.fetchall()
df=pd.DataFrame(rows,columns=['E_ID', 'E_NAME', 'E_ADDRESS', 'E_SALARY', 'H_YEAR'])

In [14]:
df.head()

   E_ID     E_NAME E_ADDRESS  E_SALARY  H_YEAR
0     1    SHIVANI    MEERUT     60000    2015
1     2     ARPITA  GAZIABAD     60000    2016
2     3        RAJ    MEERUT     55000    2017
3     4  SHREYANSH   LUCKNOW     65000    2015

In [16]:
extract_query= 'SELECT E_ID, E_SALARY FROM EMPLOYEES'
cursor.execute(extract_query)
EMPLOYEES = cursor.fetchall()
updated_salary= [(E_SALARY*1.10, E_ID) for E_ID, E_SALARY in EMPLOYEES]
update_query= 'UPDATE EMPLOYEES SET E_SALARY=%s WHERE E_ID=%s'
cursor.executemany(update_query, updated_salary)
cursor.execute(select_query)
rows = cursor.fetchall()
df=pd.DataFrame(rows,columns=['E_ID', 'E_NAME', 'E_ADDRESS', 'E_SALARY', 'H_YEAR'])
print(df)

   E_ID     E_NAME E_ADDRESS  E_SALARY  H_YEAR
0     1    SHIVANI    MEERUT     66000    2015
1     2     ARPITA  GAZIABAD     66000    2016
2     3        RAJ    MEERUT     60500    2017
3     4  SHREYANSH   LUCKNOW     71500    2015

In [22]:
# Show available databases
cursor.execute("SHOW DATABASES")

for db in cursor:
    print(db)

('information_schema',)
('mysql',)
('performance_schema',)
('SEM_4',)
('SQL_EXERCISES',)
('sys',)

In [24]:
cursor.execute("CREATE DATABASE HR")
print("Database 'HR' created successfully!")

Database 'HR' created successfully!